In [1]:
import pandas as pd

test_scores = pd.read_excel('test_scores.xlsx')
test_scores.head()

           district    M    R    S
0        Fox Chapel  473  447  460
1         Tuscarora  536  450  493
2  Sautee Nacoochee  463  439  451
3         Fort Peck  559  448  504
4        North Pole  489  447  468

In [2]:
scores_pivot = pd.melt(frame=test_scores, id_vars = 'district', 
        value_vars=['M', 'R', 'S'], value_name='score', var_name='test_type')
scores_pivot.head()

           district test_type  score
0        Fox Chapel         M    473
1         Tuscarora         M    536
2  Sautee Nacoochee         M    463
3         Fort Peck         M    559
4        North Pole         M    489

In [3]:
scores_pivot['test_type'].unique()

array(['M', 'R', 'S'], dtype=object)

In [4]:
mapping = {'M':'math','R':'reading', 'S':'science'}
scores_pivot['test_type'] = scores_pivot['test_type'].map(mapping)


scores_pivot['test_type'].unique()

array(['math', 'reading', 'science'], dtype=object)

In [10]:
scores_pivot.pivot_table(index='district', 
                       columns='test_type', values='score')

test_type        math  reading  science
district
Aguadilla         513      416      465
Amalga            506      433      470
Angier            444      411      428
Arenzville        405      410      408
Asheville         489      433      461
...               ...      ...      ...
Waldenburg        500      451      476
Whitley Gardens   423      395      409
Wiley             626      465      546
Woodlyn           454      421      438
Worton            463      402      433

[100 rows x 3 columns]